alpri0265/STM32F407ZET6-MODUL-1/Src/screens.c
static void render_info_z_passes(void)
{
    unsigned int n = jog_get_z_passes();
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "Z: passes (axis Z) ");
    (void)snprintf(buf, sizeof(buf), "Passes: %u         ", n);
    buf[LINE_LEN] = '\0';
    lcd_print_line(1, buf);
    lcd_print_line(2, "0=unlimited        ");
    lcd_print_line(3, "Dn+ Up- [Ent]=Back ");
}

/* Фокус на екрані X passes: 0 = Passes, 1 = X- depth */
static unsigned int s_x_passes_focus = 1u;
static menu_screen_id_t s_prev_menu_screen = (menu_screen_id_t)-1;

/* X: проходів по X (ліміт) та глибина X- (0.01..0.30 mm) після кожного проходу Z.
 * Значення виводимо цілими (0.%02u), щоб не залежати від _printf_float. */
static void render_info_x_passes(void)
{
    unsigned int passes = jog_get_x_passes();
    unsigned int step_i = jog_get_x_step_index();
    unsigned int step_val = step_i + 1u;  /* 1..30 → 0.01..0.30 */
    char buf[LINE_LEN + 2];
    const char *cur0 = (s_x_passes_focus == 0u) ? ">" : " ";
    const char *cur1 = (s_x_passes_focus == 1u) ? ">" : " ";
    lcd_print_line(0, "X passes & depth  ");
    (void)snprintf(buf, sizeof(buf), "%sPasses: %u        ", cur0, passes);
    buf[LINE_LEN] = '\0';
    lcd_print_line(1, buf);
    (void)snprintf(buf, sizeof(buf), "%s X- 0.%02u mm     ", cur1, step_val);
    buf[LINE_LEN] = '\0';
    lcd_print_line(2, buf);
    lcd_print_line(3, "Dn+ Up- [Ent]=row");
}

static void render_info_axis_x(void)
{
    const axis_cfg_t *c = system_axis_cfg(AXIS_X);
    char buf[LINE_LEN + 2];
    char tmp[48];
    unsigned long spmm = (unsigned long)(c->steps_per_mm + 0.5f);
    unsigned long mf = (unsigned long)(c->max_feed + 0.5f);
    int minm = (int)(c->min_mm);
    int maxm = (int)(c->max_mm);
    lcd_print_line(0, "Axis X             ");
    (void)snprintf(tmp, sizeof(tmp), "steps/mm: %lu     ", spmm);
    (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
    buf[LINE_LEN] = '\0';
    lcd_print_line(1, buf);
    (void)snprintf(tmp, sizeof(tmp), "%cmax: %lu        ", (axis_edit_field == 0u) ? '>' : ' ', mf);
    (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
    buf[LINE_LEN] = '\0';
    lcd_print_line(2, buf);
    if (axis_edit_field == 1u)
        (void)snprintf(tmp, sizeof(tmp), ">min %d max %d   ", minm, maxm);
    else if (axis_edit_field == 2u)
        (void)snprintf(tmp, sizeof(tmp), " min %d>max %d  ", minm, maxm);
    else
        (void)snprintf(tmp, sizeof(tmp), " min %d max %d   ", minm, maxm);
    (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
    buf[LINE_LEN] = '\0';
    lcd_print_line(3, buf);
}

static void render_info_axis_z(void)
{
    const axis_cfg_t *c = system_axis_cfg(AXIS_Z);
    char buf[LINE_LEN + 2];
    char tmp[48];
    unsigned long spmm = (unsigned long)(c->steps_per_mm + 0.5f);
    unsigned long mf = (unsigned long)(c->max_feed + 0.5f);
    int minm = (int)(c->min_mm);
    int maxm = (int)(c->max_mm);
    lcd_print_line(0, "Axis Z             ");
    (void)snprintf(tmp, sizeof(tmp), "steps/mm: %lu     ", spmm);
    (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
    buf[LINE_LEN] = '\0';
    lcd_print_line(1, buf);
    (void)snprintf(tmp, sizeof(tmp), "%cmax: %lu        ", (axis_edit_field == 0u) ? '>' : ' ', mf);
    (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
    buf[LINE_LEN] = '\0';
    lcd_print_line(2, buf);
    if (axis_edit_field == 1u)
        (void)snprintf(tmp, sizeof(tmp), ">min %d max %d   ", minm, maxm);
    else if (axis_edit_field == 2u)
        (void)snprintf(tmp, sizeof(tmp), " min %d>max %d  ", minm, maxm);
    else
        (void)snprintf(tmp, sizeof(tmp), " min %d max %d   ", minm, maxm);
    (void)snprintf(buf, sizeof(buf), "%-20.20s", tmp);
    buf[LINE_LEN] = '\0';
    lcd_print_line(3, buf);
}

/* Усі кінцевики — індуктивні NPN: спрацювання = LOW (вихід сенсора в GND) */
static bool limits_read_x_neg(void) { return HAL_GPIO_ReadPin(LIM_X_NEG_GPIO_Port, LIM_X_NEG_Pin) == GPIO_PIN_RESET; }
static bool limits_read_x_pos(void) { return HAL_GPIO_ReadPin(LIM_X_POS_GPIO_Port, LIM_X_POS_Pin) == GPIO_PIN_RESET; }
static bool limits_read_z_neg(void) { return HAL_GPIO_ReadPin(LIM_Z_NEG_GPIO_Port, LIM_Z_NEG_Pin) == GPIO_PIN_RESET; }
static bool limits_read_z_pos(void) { return HAL_GPIO_ReadPin(LIM_Z_POS_GPIO_Port, LIM_Z_POS_Pin) == GPIO_PIN_RESET; }

static void render_info_limits(void)
{
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "Limits status      ");
    lcd_print_line(1, "X-  X+  Z-  Z+     ");
    (void)snprintf(buf, sizeof(buf), " %d   %d   %d   %d       ",
        limits_read_x_neg() ? 1 : 0, limits_read_x_pos() ? 1 : 0,
        limits_read_z_neg() ? 1 : 0, limits_read_z_pos() ? 1 : 0);
    lcd_print_line(2, buf);
    lcd_print_line(3, "[Back]             ");
}

/* Тест кнопок та LED програмних лімітів (SL). На екрані — стан кнопок; LED світяться при натисканні. */
static void render_info_sl_test(void)
{
    unsigned int xn = sl_limits_btn_x_neg() ? 1u : 0u;
    unsigned int xp = sl_limits_btn_x_pos() ? 1u : 0u;
    unsigned int zn = sl_limits_btn_z_neg() ? 1u : 0u;
    unsigned int zp = sl_limits_btn_z_pos() ? 1u : 0u;
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "SL buttons & LEDs   ");
    lcd_print_line(1, "X-   X+   Z-   Z+  ");
    (void)snprintf(buf, sizeof(buf), " %u    %u    %u    %u   ", xn, xp, zn, zp);
    buf[LINE_LEN] = '\0';
    lcd_print_line(2, buf);
    lcd_print_line(3, "Press=LED on [Back]");
}

static void render_info_i2c_lcd(void)
{
    lcd_print_line(0, "I2C/LCD test       ");
    lcd_print_line(1, "OK                 ");
    lcd_print_line(2, "addr 0x27          ");
    lcd_print_line(3, "[Back]             ");
}

static void render_info_encoders(void)
{
    float x_mm = axis_feedback_pos_mm(AXIS_X);
    float z_mm = axis_feedback_pos_mm(AXIS_Z);
    char buf[LINE_LEN + 2];
    lcd_print_line(0, "Encoders X / Z     ");
    (void)snprintf(buf, sizeof(buf), "X: %.2f mm       ", (double)x_mm);
    lcd_print_line(1, buf);
    (void)snprintf(buf, sizeof(buf), "Z: %.2f mm       ", (double)z_mm);
    lcd_print_line(2, buf);
    lcd_print_line(3, "[Back]             ");
}

static void render_info_adc_fault(void)
{
    uint16_t feed_raw = adc_if_read(ADC_CH_FEED_OVERRIDE);
    uint16_t enc_raw = adc_if_read(ADC_CH_TOOL_ANGLE);
    float enc_deg_f = (float)enc_raw * 360.0f / 4095.0f;
    unsigned int enc_d = (unsigned int)enc_deg_f;
    unsigned int enc_t = (unsigned int)(enc_deg_f * 10.0f) % 10u;
    uint16_t fault = fault_get();
    /* +8: snprintf "Feed raw: " + 5 цифр %u + вирівнювання без упередження -Wformat-truncation */
    char buf[LINE_LEN + 8];
    lcd_print_line(0, "ADC / Fault            ");
    (void)snprintf(buf, sizeof(buf), "Feed raw: %-5u       ", (unsigned)feed_raw);
    buf[LINE_LEN] = '\0';
    lcd_print_line(1, buf);
    (void)snprintf(buf, sizeof(buf), "Enc: %u.%u %c          ", enc_d, enc_t, 0xFF);
    buf[LINE_LEN] = '\0';
    lcd_print_line_deg(2, buf);
    (void)snprintf(buf, sizeof(buf), "Fault: %u [Back]    ", (unsigned)fault);
    buf[LINE_LEN] = '\0';
    lcd_print_line(3, buf);
}

static void render_info_tool_angle_calib(void)
{
    float deg = tool_angle_get_deg();
    unsigned int d = (unsigned int)deg;
    unsigned int t = (unsigned int)(deg * 10.0f) % 10u;
    char buf[LINE_LEN + 4];
    lcd_print_line(0, "Calibrate encoder   ");
    lcd_print_line(1, "Set to 180 deg then ");
    lcd_print_line(2, "Enter=Cal Up=Back   ");
    (void)snprintf(buf, sizeof(buf), "  Now: %u.%u %c      ", d, t, 0xFF);
    buf[LINE_LEN] = '\0';
    lcd_print_line_deg(3, buf);
}

static void render_info_tool_angle(void)
{
    char buf[LINE_LEN + 4];
    if (tool_angle_edit_mode) {
        unsigned int v = tool_angle_edit_value;
        unsigned int h = (v / 10u) / 100u;   /* сотні 0-3 */
        unsigned int t = (v / 10u) / 10u % 10u;
        unsigned int o = (v / 10u) % 10u;
        unsigned int d = v % 10u;             /* десяті */
        (void)snprintf(buf, sizeof(buf), "Set angle (%c)        ", 0xFF);
        buf[LINE_LEN] = '\0';
        lcd_print_line_deg(0, buf);
        (void)snprintf(buf, sizeof(buf), "Set: %u%u%u.%u%c     ", h, t, o, d, 0xFF);
        buf[LINE_LEN] = '\0';
        lcd_print_line_deg(1, buf);
        /* Курсор під розрядом: "Set: " = 5 символів, потім цифри 5,6,7, крапка 8, цифра 9 */
        { char cur[LINE_LEN + 1]; unsigned int i, pos = (tool_angle_edit_cursor < 3u) ? (5u + tool_angle_edit_cursor) : 9u;
          for (i = 0u; i < LINE_LEN; i++) cur[i] = (i == pos) ? '^' : ' ';
          cur[LINE_LEN] = '\0';
          lcd_print_line(2, cur); }
        lcd_print_line(3, "Enter=next Up/Down=+/- ");
    } else {
        float deg = tool_angle_get_deg();
        unsigned int d = (unsigned int)deg;
        unsigned int t = (unsigned int)(deg * 10.0f) % 10u;
        lcd_print_line(0, "  Kut instrumentu      ");
        (void)snprintf(buf, sizeof(buf), "  %u.%u %c            ", d, t, 0xFF);
        buf[LINE_LEN] = '\0';
        lcd_print_line_deg(1, buf);
        lcd_print_line(2, "Enter=Zero Down=Set    ");
        lcd_print_line(3, "Up=Back               ");
    }
}

/* Оновлює тільки рядок з кутом — без перемальовування всього екрану, щоб не мерехтіло */
static void tool_angle_refresh_value_only(void)
{
    float deg = tool_angle_get_deg();
    unsigned int d = (unsigned int)deg;
    unsigned int t = (unsigned int)(deg * 10.0f) % 10u;
    char buf[LINE_LEN + 4];
    (void)snprintf(buf, sizeof(buf), "  %u.%u %c            ", d, t, 0xFF);
    buf[LINE_LEN] = '\0';
    lcd_print_line_deg(1, buf);
}

